{
  "texts": [
    {
      "paragraph": "Mitt namn är Daniel Lindgren och studerar webbprogrammering. Jag är uppvuxen i en by i Dalarna som är placerad mellan Borlänge och Falun. Under gymnasietiden ville jag bli ambulanssjukvårdare, men samma år som jag skulle ta studenten ändrades kraven från ett års studier till att man skulle studera till sjuksköterska i tre år, jobba som det i ett och sedan studera ett år till för att kunna bli ambulanssjukvårdare. Alldeles för lång tid för en kille som ville ut i arbetslivet. Efter gymnasiet gjorde jag lumpen ett år i Boden som bevakningssoldat. Genom lumpen fick jag en utbildning som säkerhetsvakt vilket ledde till att jag började jobba på Securitas ett par år, men nattskiften började slita på mig så jag bestämde mig för att samla ihop pengar för att kunna backpacka i Australien. Sagt och gjort, jobbade så mycket jag kunde till hösten samma år varpå jag åkte iväg och backpackade i tre månader på egen hand. När jag kom hem igen fick jag jobb på Rusta som säljare. Medan jag arbetade på Rusta åkte jag och två vänner iväg på tågluff genom Europa. Jag trivdes bra på jobbet men insåg att det var näst intill omöjligt att få en heltidstjänst där så jag funderade på vad jag ville göra i framtiden. En dag när jag satt framför datorn och skrev en hemsida om E-sport så insåg jag att jag hade svaret framför mina ögon. Programmering, speciellt mot webben. Så jag sökte mig till BTH och deras webbprogrammeringslinje och kom in. När jag inte programmerar så spelar jag gärna indiespel eller FPS. Gymmar ett par gånger i veckan och samlar på hattar."
    },
    {
      "paragraph": "Här på BTH har jag gått kurser inom PHP, JavaScript, Java, C++, JQMobile, Mithril och en del teoretiska kurser. Jag har jobbat som ambassadör för skolan, men har slutat då det är mycket som ska göras nu i trean. Det var väldigt kul att få åka ut till gymnasier och prata om skolan, studentlivet över lag och svara på frågor som eleverna hade. Vi hade ett studentprojekt på Ericsson i en termin där vi fick utveckla ett system för dem. Det var väldigt givande att få göra något skarpt för en gångs skull och inte bara följa lärarnas riktlinjer. Första terminen i trean studerade jag i Eindhoven i Nederländerna där jag fick prova på systemutveckling. Det var väldigt mycket nytt att lära sig, till exempel behövde jag sätta mig in i C# som är standarden på Fonty's School of Applied Science. Det var en del krångel att komma igång men tack vare de vänner jag träffade där gick det helt okej. Nu har vi ett kandidatarbete som jag tillsammans med Viktor Andersson ska forska i SEO och hur man kan förbättra rankingen för den här sidan. Vi valde att göra Daniel Lindgren online CV då det inte kräver så mycket för att komma igång, och det kommer att vara användbart i framtiden. Tack vare det så har den här sidan skapats och jag har gjort den i Mitrhil då den ska vara mobile friendly, och all text ni ser på sidan är hämtad från JSON-filer. Vi har även ett större grupprojekt på SoftHouse som jag finner väldigt intressant."
    }
  ],
  "title": "Välkommen till Daniel Lindgren online CV!"
}